[
  {
    "unique_identifier": "ARC-00001",
    "codename": "Adam - The History Fog",
    "classification": "Entity",
    "status": "Active, Joined",
    "power_abilities": {
      "name": "The History Fog",
      "description": "All records of his past are obscured, making it impossible to track his true origins."
    },
    "level": 0,
    "description": "Adam is one of the founding members of the Ouroboros Organization. His existence is shrouded in mystery—every attempt to document him is lost in the fog of time. He appears unpredictably to guide the Foundation at crucial moments.",
    "containment_procedures": "Due to his nature, standard containment is not applicable. He is monitored indirectly via the Foundation’s temporal network.",
    "discovery_log": "First observed during the early formation of Ouroboros. All records have been obscured by his unique power.",
    "addenda_notes": "Ongoing research into subject's interactions with temporal anomalies.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-00005",
    "codename": "The Oracle - The Machine Seer",
    "classification": "Entity",
    "status": "Active, Joined",
    "power_abilities": {
      "name": "Infinite Sight",
      "description": "A first-generation seer integrated with advanced machinery, allowing her to process vast amounts of future data. She remains immune to temporal paradoxes."
    },
    "level": 1,
    "description": "The Oracle is fused with the core systems of Ouroboros, acting as the strategic mind behind operations. Her origins have been erased from the timeline, leaving only her function as a predictive engine.",
    "containment_procedures": "Maintained within the Ouroboros mainframe; physical containment is unnecessary.",
    "discovery_log": "Discovered during a significant temporal anomaly event. Full records remain classified.",
    "addenda_notes": "Critical for operational decisions and timeline stabilization.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-00391",
    "codename": "Holo - The Librarian",
    "classification": "Entity",
    "status": "Active, Joined",
    "power_abilities": {
      "name": "Watcher Library",
      "description": "An esper power that records all events in time in a vast, metaphysical library. Capable of preserving even those events altered or erased from conventional history."
    },
    "level": 2,
    "description": "Holo embodies the law of record-keeping in the world. Through the Watcher Library, every anomaly is logged and archived, making him indispensable for maintaining timeline integrity.",
    "containment_procedures": "Integrated with Ouroboros archival systems; continuous monitoring is maintained.",
    "discovery_log": "Established during the Foundation's initial efforts to catalog temporal anomalies.",
    "addenda_notes": "Serves as the primary reference for all historical and temporal data.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-00027",
    "codename": "Cain - The Sage",
    "classification": "Entity",
    "status": "Active, Joined",
    "power_abilities": {
      "name": "The Eternal Witness",
      "description": "An immortal anomaly who has lived countless lives as king, beggar, scholar, and merchant. Notably known in one era as Solomon, though devoid of demonic influences."
    },
    "level": 3,
    "description": "Cain is a timeless observer, embodying the wisdom and immutable laws of history. His experiences span across eras, and he advises the Foundation on the unalterable aspects of the timeline.",
    "containment_procedures": "Subject is allowed freedom within secure temporal zones; his natural integration with history precludes standard containment.",
    "discovery_log": "Records span across unrecorded eras; his presence is accepted as a natural constant.",
    "addenda_notes": "A pivotal advisor on the immutable laws of time.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-99999",
    "codename": "Noah - The Survivor",
    "classification": "Entity",
    "status": "Active, Joined",
    "power_abilities": {
      "name": "The Absolute Event",
      "description": "Ensures that humanity endures across all possible futures. Attempts to erase or alter Noah result in immediate temporal corrections that guarantee her survival."
    },
    "level": 4,
    "description": "Noah represents the future that must occur—the living proof of humanity’s continued existence. Her presence is a fixed point that stabilizes the timeline, making extinction impossible.",
    "containment_procedures": "Traditional containment is not applicable due to paradox immunity; the subject is monitored for timeline integrity.",
    "discovery_log": "Identified as a key temporal anomaly whose survival ensures a viable future for humanity.",
    "addenda_notes": "Her continued existence is a guaranteed event across all recorded history.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-43271",
    "codename": "The Blade of Eternal Dusk",
    "classification": "Artifact",
    "status": "Secure Containment",
    "power_abilities": {
      "name": "Time Freeze",
      "description": "A longsword that freezes time within its cutting path for exactly 4 seconds. The user is also affected, acting only after time resumes."
    },
    "level": 4,
    "description": "This black longsword with glowing red runes was discovered on an ancient battlefield. Its origins are unknown, and its potential for halting temporal flow makes it a high-risk artifact.",
    "containment_procedures": "Stored in a secure temporal vault; only accessible under strict protocols.",
    "discovery_log": "Recovered from ancient ruins; further study is ongoing.",
    "addenda_notes": "Artifact exhibits unpredictable effects when wielded by untrained users.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-01077",
    "codename": "The Gentleman’s Pocket Watch",
    "classification": "Artifact",
    "status": "Contained",
    "power_abilities": {
      "name": "Temporal Counter",
      "description": "A gold pocket watch that counts the number of candies its user eats. Its count remains unaffected by any time alterations—even if the user is erased from history."
    },
    "level": 7,
    "description": "An innocuous-looking pocket watch with an anomalous property: its count continues regardless of timeline changes. It has become a quirky yet reliable tool for recording minor events.",
    "containment_procedures": "Stored in a low-security archive; periodic testing is performed to verify count integrity.",
    "discovery_log": "Found on a collector's shelf; its anomaly was discovered during routine testing.",
    "addenda_notes": "Considered low risk but of interest for its temporal stability.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-77777",
    "codename": "The Revenant",
    "classification": "Entity",
    "status": "Unknown",
    "power_abilities": {
      "name": "Perpetual Resurrection",
      "description": "A man who revives at any point in his past life after death, preserving his memories and enabling him to alter his decisions in each iteration."
    },
    "level": 2,
    "description": "Known as The Revenant, this anomaly has survived for millennia by continuously resurrecting. His motives remain elusive, and his ability to reappear in different eras makes him a persistent enigma.",
    "containment_procedures": "Currently uncontainable; monitored through multitemporal tracking systems.",
    "discovery_log": "Subject observed across numerous historical records; classified as high priority due to unpredictability.",
    "addenda_notes": "Further research is required to determine his long-term impact on the timeline.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-01189",
    "codename": "The Coin of the Dead",
    "classification": "Artifact",
    "status": "Lost",
    "power_abilities": {
      "name": "Memory Exchange",
      "description": "A silver coin that allows its user to exchange one memory with a deceased individual. The dead briefly return to impart information before vanishing; the user permanently loses the exchanged memory."
    },
    "level": 5,
    "description": "Once contained and used in controlled experiments, the coin is now missing after an incident involving a rogue agent.",
    "containment_procedures": "Previously secured in a temporal vault; currently unaccounted for.",
    "discovery_log": "Last seen during a controlled test; now classified as a lost artifact.",
    "addenda_notes": "Investigation into recovery is ongoing.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-12043",
    "codename": "The Sunken Clocktower",
    "classification": "Area",
    "status": "Monitored",
    "power_abilities": {
      "name": "Temporal Regression",
      "description": "A submerged ruin where time flows backward at a variable rate, causing travelers to de-age upon entry."
    },
    "level": 4,
    "description": "Located at the bottom of an uncharted lake, this ancient clocktower exhibits an unnatural reversal of time. It poses risks to those who inadvertently enter its vicinity.",
    "containment_procedures": "A secured perimeter is maintained to prevent accidental entry; research is ongoing.",
    "discovery_log": "Discovered during a survey of anomalous aquatic sites; remains under continuous observation.",
    "addenda_notes": "Subject to further temporal studies to determine safe entry protocols.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-98456",
    "codename": "The Theater of Rewritten Fate",
    "classification": "Event",
    "status": "Ongoing",
    "power_abilities": {
      "name": "Fated Performance",
      "description": "A mysterious theater that appears unpredictably. Attendees are forced to view a play depicting their future and are then given an irreversible choice to change one event in their lives."
    },
    "level": 3,
    "description": "This temporal phenomenon manifests sporadically in various eras. Those who participate in the play risk permanent alterations to their personal timeline.",
    "containment_procedures": "Monitoring units are deployed to track its appearances; direct intervention is limited due to unpredictable nature.",
    "discovery_log": "First documented after multiple reports of vanished individuals; remains an active temporal anomaly.",
    "addenda_notes": "Further study is needed to assess long-term consequences of altering fate.",
    "affiliations": ["Ouroboros Organization"]
  },
  {
    "unique_identifier": "ARC-07888",
    "codename": "Benjamin Button",
    "classification": "Entity",
    "status": "Active, Rogue",
    "power_abilities": {
      "name": "Reverse Chronology",
      "description": "Exhibits reverse aging; the subject's physical body ages backward over time. This anomaly creates unpredictable effects on personal timeline stability."
    },
    "level": 5,
    "description": "Codenamed 'Benjamin Button' due to his reverse aging trait, this entity's power is reminiscent of the film but is entirely an independent anomaly. His condition poses unique challenges to temporal stability and personal continuity.",
    "containment_procedures": "Contained within a temporal stabilization chamber to mitigate uncontrolled reverse aging effects.",
    "discovery_log": "Discovered in a small town after reports of an individual whose biological age contradicted his chronological age; further details remain classified.",
    "addenda_notes": "Ongoing research is evaluating the potential applications and risks of reverse chronology in human subjects.",
    "affiliations": ["Ouroboros Organization"]
  },
    {
      "unique_identifier": "ARC-20001",
      "codename": "Mass-Produced Time Suit",
      "classification": "Artifact",
      "status": "Contained",
      "power_abilities": {
        "name": "Temporal Shield",
        "description": "A standardized time suit that prevents time alterations from affecting the wearer. It requires high energy consumption and is not suitable for prolonged use."
      },
      "level": 5,
      "description": "A mass-produced suit designed for temporary protection against time distortions. While effective in the short term, its heavy energy demands make it impractical for extended missions.",
      "containment_procedures": "Stored in a secure technology vault. Issued only under strict operational protocols.",
      "discovery_log": "Developed by OUROBOS engineers during the early 4D incursions.",
      "addenda_notes": "Regular energy audits required to monitor suit performance.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-41343",
      "codename": "The Missing Day",
      "classification": "Event",
      "status": "Ongoing",
      "power_abilities": {
        "name": "Temporal Erasure",
        "description": "A time rift occurring between July 7 and 9 of an unspecified year, causing the world to skip an entire day without notice."
      },
      "level": 4,
      "description": "An inexplicable temporal event where a day vanishes from existence. Despite its global impact, no one notices the missing day as events resume normally afterward.",
      "containment_procedures": "Monitored remotely with minimal intervention to avoid further timeline disruption.",
      "discovery_log": "First recorded following anomalous temporal sensor readings spanning July 7–9.",
      "addenda_notes": "Research into the cause and potential recovery of the lost time is ongoing.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-35617",
      "codename": "Time Crystal Cavern",
      "classification": "Area",
      "status": "Under Organization Control",
      "power_abilities": {
        "name": "Condensed Temporal Energy",
        "description": "A cavern located between the Missing Day rift that converts stolen time from July 8 into highly condensed crystal energy."
      },
      "level": 4,
      "description": "An underground cavern that harnesses temporal energy by crystallizing the lost time from a vanished day. The cavern is tightly controlled by OUROBOS for study and strategic resource extraction.",
      "containment_procedures": "Secured perimeter and continuous energy monitoring are maintained.",
      "discovery_log": "Identified shortly after the observation of the Missing Day phenomenon.",
      "addenda_notes": "Further analysis on energy stability and potential applications is underway.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-35618",
      "codename": "Time Crystal",
      "classification": "Artifact",
      "status": "Contained",
      "power_abilities": {
        "name": "Temporal Conduction",
        "description": "A crystalline artifact formed from concentrated temporal energy. It exhibits unique properties that manipulate time flow on a small scale."
      },
      "level": 5,
      "description": "An artifact derived from the energy of the Time Crystal Cavern. Its properties include subtle time dilation and acceleration effects, making it a subject of intense study.",
      "containment_procedures": "Housed in a secure temporal containment unit with strict energy regulation protocols.",
      "discovery_log": "Recovered from within the Time Crystal Cavern.",
      "addenda_notes": "Potential applications in controlled time manipulation are being investigated.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-00004",
      "codename": "The Infinite Castle",
      "classification": "Area",
      "status": "Active, Operational",
      "power_abilities": {
        "name": "Temporal Nexus",
        "description": "A fortress that exists both as a physical structure and a temporal conduit, enabling time travel and housing integrated technologies, magic, and part of the Oracle’s consciousness."
      },
      "level": 0,
      "description": "The headquarters of OUROBOS, the Infinite Castle is both an impenetrable fortress and a gateway to time travel. It serves as a backup body for the Oracle, enhancing her computational and predictive capabilities while operating in power-saving modes.",
      "containment_procedures": "Maintained by high-level security protocols and temporal stabilization systems.",
      "discovery_log": "Established as the nexus for OUROBOS operations, its origins are intertwined with the organization’s early history.",
      "addenda_notes": "Critical for both defensive operations and strategic time manipulation.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-99998",
      "codename": "The Ark",
      "classification": "Artifact",
      "status": "Damaged",
      "power_abilities": {
        "name": "Chrono-Vessel",
        "description": "A highly advanced space-time ship capable of protecting its occupant from even 0-level singularities. Its operations require enormous energy consumption."
      },
      "level": 0,
      "description": "A cutting-edge vessel that transported Noah into the past. Though it offers exceptional protection, its extreme energy demands limit its usage to only the most critical situations.",
      "containment_procedures": "Under repair and maintained in a dedicated temporal hangar with energy reserves closely monitored.",
      "discovery_log": "Recovered during a high-priority temporal incursion; its technology remains partially experimental.",
      "addenda_notes": "Currently undergoing repairs due to energy instability and structural damage.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-93340",
      "codename": "Zues",
      "classification": "Entity",
      "status": "Active, Joined",
      "power_abilities": {
        "name": "Electrokinetic Command",
        "description": "An esper from ancient Greece who masqueraded as the god Zues. His electrical power can incinerate an oak tree on command, though he requires the time suit to mitigate timeline alterations."
      },
      "level": 3,
      "description": "Zues, captain of Squad 9 from the Temporal Investigation Bureau, uses his mastery over electricity and his specialized time suit during missions. His deceptive nature allowed him to pass as a Greek deity among mortals.",
      "containment_procedures": "Operates under controlled deployment conditions with integrated time suit monitoring.",
      "discovery_log": "Identified during a mission in ancient Greece; his true nature was revealed during temporal stabilization protocols.",
      "addenda_notes": "Regular performance reviews are conducted to assess his integration with timeline protocols.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-96656",
      "codename": "Lu ZiGang",
      "classification": "Entity",
      "status": "Active, Joined",
      "power_abilities": {
        "name": "Temporal Alteration",
        "description": "Originally a jade worker from ancient China whose intervention on a mission caused a significant timeline alteration. His timeline was split—one version became 'Faceless' while the older self evolved into a monk."
      },
      "level": 3,
      "description": "Lu ZiGang's unique experience of diverging timelines has left him with dual identities. The older version lives as a monk while the younger, 'Faceless' version is absorbed into OUROBOS operations, contributing his expertise on temporal anomalies.",
      "containment_procedures": "Monitored through multitemporal tracking; operates under specialized containment protocols that account for dual timeline existence.",
      "discovery_log": "Detected following a major mission incident involving timeline separation; subsequent investigations confirmed his dual nature.",
      "addenda_notes": "Continued research required to fully understand his dual identity and its implications on historical events.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-20009",
      "codename": "Ling Shen - The Mad Scientist",
      "classification": "Entity",
      "status": "Active, Joined",
      "power_abilities": {
        "name": "Forbidden Knowledge Anchor",
        "description": "Generates a personal temporal anchor that resists changes to the timeline, allowing him to pursue forbidden knowledge without being altered by temporal shifts."
      },
      "level": 3,
      "description": "A powerful Second Generation Singularity, Ling Shen was once a rogue singularity before joining OUROBOS. His brilliance and reckless pursuit of forbidden knowledge make him both a valuable and unpredictable asset.",
      "containment_procedures": "Operates independently under specialized monitoring; his anchor makes standard containment protocols ineffective.",
      "discovery_log": "Identified after a series of chaotic temporal events attributed to rogue singularity behavior.",
      "addenda_notes": "His unyielding adherence to personal rules and revelations of his true identity pose potential risks in controlled operations.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-20010",
      "codename": "Ye Shen - The Phantom Manipulator",
      "classification": "Entity",
      "status": "Active, Joined",
      "power_abilities": {
        "name": "Memory and Identity Rewriting",
        "description": "Masterfully rewrites memories and identities with a mere glance or word, remaining elusive through constant disguise and erasure of traces."
      },
      "level": 3,
      "description": "A former rogue singularity, Ye Shen now operates as a high-level agent. His uncanny manipulation of minds and identities makes him both a formidable asset and a potential threat.",
      "containment_procedures": "Operates with minimal direct oversight due to his autonomous nature; continuous monitoring ensures his actions remain within operational boundaries.",
      "discovery_log": "First detected during an incident marked by extensive memory and identity distortions across multiple timelines.",
      "addenda_notes": "His subtle influence often renders him a silent orchestrator behind major events.",
      "affiliations": ["Ouroboros Organization"]
    },
    {
      "unique_identifier": "ARC-20011",
      "codename": "Jing Shen - The Apostle of Madness",
      "classification": "Entity",
      "status": "Active, Joined",
      "power_abilities": {
        "name": "Reality-Bending Belief",
        "description": "Alters reality based solely on his fervent beliefs; his power intensifies with his delusions, reshaping the world around him."
      },
      "level": 3,
      "description": "Once a rogue singularity, Jing Shen now serves as an unpredictable yet potent agent within OUROBOS. His ability to reshape reality through sheer belief marks him as both dangerous and crucial in chaotic operations.",
      "containment_procedures": "Subject to dynamic containment protocols designed to adapt to his shifting reality-bending effects.",
      "discovery_log": "Confirmed during an episode of extreme temporal distortion, where his delusional state triggered significant anomalies.",
      "addenda_notes": "His fanaticism is both a source of power and a liability, requiring careful management during missions.",
      "affiliations": ["Ouroboros Organization"]
    }
]
